Tekla Open API Reference for Tekla Structures 2025
StraightDimensionSet.Attributes Property
 The straight dimension set attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public StraightDimensionSet.StraightDimensionSetAttributes Attributes { get; set; }
Public Property Attributes As StraightDimensionSet.StraightDimensionSetAttributes
	Get
	Set
Property Value
Type: StraightDimensionSet.StraightDimensionSetAttributes
See Also
Reference
StraightDimensionSet Class
Tekla.Structures.Drawing Namespace